In [2]:
import pandas as pd

In [6]:
estacions_bicing = pd.read_csv('data/estacions_bicing.csv', sep = ';')

In [24]:
estacions_bicing.head()

   Anys  Valor
0  2007    194
1  2008    390
2  2009    419
3  2010    420
4  2011    421

In [18]:
abonats_bicing = pd.read_csv('data/abonats_bicing.csv', sep=';', encoding = 'ISO-8859-1')

In [25]:
abonats_bicing

   Anys     Mes  Valor
0  2014   Anual  96252
1  2014   Gener      0
2  2014  Febrer      0
3  2014    Març  99401
4  2014   Abril  99038

In [26]:
demanda_bicing = pd.read_csv('data/demanda_bicing.csv', sep = ';', encoding = 'ISO-8859-1')

In [27]:
demanda_bicing

   Anys     Mes    Valor
0  2007   Anual  3781855
1  2007   Gener        0
2  2007  Febrer        0
3  2007    Març      744
4  2007   Abril    18684

In [29]:
km_data = {'Anys': [2013, 2014, 2015, 2016, 2017] , 'Km': [104.9, 116.0, 120.0, 126.2, 157.1]}
km_bike_road = pd.DataFrame(data = km_data)
km_bike_road.head()

   Anys     Km
0  2013  104.9
1  2014  116.0
2  2015  120.0
3  2016  126.2
4  2017  157.1

In [4]:
parking_slots = {'Anys': [2013, 2014, 2015, 2016, 2017], 'Dimensió(km)': [22350, 23559, 24589, 26158, 33834]}
ps_df = pd.DataFrame(data = parking_slots)
ps_df

   Anys  Dimensió(km)
0  2013         22350
1  2014         23559
2  2015         24589
3  2016         26158
4  2017         33834

In [6]:
electric_bikes = {'Anys': [2015, 2016, 2017], 'Abonats': [5153, 7784, 9174], 'Viatges': [53475, 101837, 109674], 'Bicicletes': [300, 300, 300], 'Estacions': [46, 46, 46]}
elbikes_df = pd.DataFrame(data = electric_bikes)
elbikes_df

   Anys  Abonats  Viatges  Bicicletes  Estacions
0  2015     5153    53475         300         46
1  2016     7784   101837         300         46
2  2017     9174   109674         300         46